export const unitActivityTypeArr :string[] = [
    "בחר/י",
    'תע"ם',
    "אימונים",
    "הכשרה",
    "רגיעה / מנהלה",
    "מלחמה/מבצע צבאי נרחב",
];

export const personalActivityTypeArr :string[] = [
    "בחר/י",
    "פעילות מבצעית/לחימה",
    "אימון",
    "הכשרה",
    "שגרה",
    "פנאי",
    "חופשה",
];

export const categoryArr :string[] = [
    "בחר/י",
    "נשק ומקלעים",
    "דרכים",
    "תחמושת",
    `ירי דו"צ`,
    "מזג-אוויר",
    `רק"מ וצמ"ה קרביים`,
    `שת"פ אוויר`,
    "עבודה",
    "אוויר",
    "בטיחות ימי",
    "ספורט ואקסטרים",
    "נפילות/חבלות",
    "חריגות ירי או תנועה של כוחות בשטחי אימונים",
    `חומ"ס`,
    `אמל"ח (לא נשק/מקלעים)`,
    "אש",
    `טג"ח קרבי`,
    `שת"פ ים`,
    "ייעודי עורף/חילוץ והצלה",
    "אמצעי רום קרוב לקרקע",
    "כושר גופני/קרבי",
];

export const locationArr :string[] = ["בחר/י", "בסיס", "שטח אזרחי", "שטח אש", "רציף"];

export const eventSeverityArr :string[] = ["בחר/י", "קל", "בינוני", "חמור"];

export const resultsArr :string[] = [
    "בחר/י",
    `א.נ.א.נ (אין נפגעים, אין נזק) `,
    `א.נ.י.נ (אין נפגעים, יש נזק) `,
    `י.נ.א.נ (יש נפגעים, אין נזק) `,
    `י.נ.י.נ (יש נפגעים, יש נזק) `,
];

export const injuriesLevelArr :string[] = [
    "בחר/י",
    "ללא פגיעה",
    "פגוע קל (ללא אשפוז)",
    "פגוע קל (שאושפז)",
    "פגוע בינוני",
    "פגוע קשה/אנוש",
    "חלל",
];

export const weatherArr :string[] = [
    "בחר/י",
    "שרב/עומס חום",
    "שלג",
    "סופת חול",
    "גשם",
    "ערפל",
    "התקרחות",
    "ברד",
    "מעונן",
    "נאה",
    "רוח",
    "ים סוער",
    "מים שקטים",
]